In [1]:
#CSV-Comma separated values
#.dataframe.iloc[:5]->print first five rows
#.tsv->pd.read_csv(filepath,sep='\t')
#Space separated file ->pd.read_csv(filepath,delim_whitespace=True)
#Dont use first row as column names->pd.read_csv(filepath,heaeder=None)
#Specify column names ->data=pd.read_csv(filepath,names=['Name1','Name2'])
#custom missing values -> data=pd.read_csv(filepath,ns_values=['Na'])


#Json files
#Javascript object notation
#Json files are very similar in structure to python dictionaries
#Reading json files -> pd.read_json(filepath)
#dataframe to json -> data.to_json('Out.json')

#SQL databases
#import sqllite3 as sq3
#con=sq3.Connection(path)
#query='''SELECT * FROM rock_songs;'''
#data=pd.read_sql(query,con)


#No sql databases ->NOt only sql
#document databases ->MongoDB,couchDB
#from pymongo import MongoClient
#con=MongoClient()
#db=con.database_name
#cursor=db.collection_name.find(query)
#df=pd.DataFrame(list(cursor))

#API
#df=pd.read_csv(data_url,header=None)

import pandas as pd
import sqlite3 as sq3
import pandas.io.sql as pds

path='data/classic_rock.db'
con=sq3.Connection(path)

In [2]:
con

In [4]:
query='''SELECT * FROM rock_songs'''
observations=pd.read_sql(query,con)
observations.head()

                     Song        Artist  Release_Year  PlayCount
0        Caught Up in You   .38 Special        1982.0         82
1         Hold On Loosely   .38 Special        1981.0         85
2  Rockin' Into the Night   .38 Special        1980.0         18
3       Art For Arts Sake          10cc        1975.0          1
4              Kryptonite  3 Doors Down        2000.0         13

In [5]:
query='''SELECT Artist,Release_Year,COUNT(*) AS num_songs,AVG(PlayCount) AS avg_plays
FROM rock_songs 
GROUP BY Artist,Release_Year
ORDER BY num_songs desc'''

observations=pd.read_sql(query,con)
observations.head()

         Artist  Release_Year  num_songs  avg_plays
0   The Beatles        1967.0         23   6.565217
1  Led Zeppelin        1969.0         18  21.000000
2   The Beatles        1965.0         15   3.800000
3   The Beatles        1968.0         13  13.000000
4   The Beatles        1969.0         13  15.000000

In [6]:
path1='baseball.db'

In [7]:
con1=sq3.Connection(path1)

In [9]:
query='''SELECT * FROM allstarfull'''
x=pd.read_sql(query,con1)
print(x)

      index   playerID  yearID  gameNum        gameID teamID lgID   GP  \
0         0  gomezle01    1933        0  ALS193307060    NYA   AL  1.0
1         1  ferreri01    1933        0  ALS193307060    BOS   AL  1.0
2         2  gehrilo01    1933        0  ALS193307060    NYA   AL  1.0
3         3  gehrich01    1933        0  ALS193307060    DET   AL  1.0
4         4  dykesji01    1933        0  ALS193307060    CHA   AL  1.0
...     ...        ...     ...      ...           ...    ...  ...  ...
5143   5143  seageco01    2016        0  ALS201607120    LAN   NL  1.0
5144   5144  strasst01    2016        0  ALS201607120    WAS   NL  0.0
5145   5145  syndeno01    2016        0  ALS201607120    NYN   NL  0.0
5146   5146  teherju01    2016        0  ALS201607120    ATL   NL  1.0
5147   5147  zobribe01    2016        0  ALS201607120    CHN   NL  1.0

      startingPos
0             1.0
1             2.0
2             3.0
3             4.0
4             5.0
...           ...
5143          NaN
5144          NaN
5145          NaN
5146          NaN
5147          4.0

[5148 rows x 9 columns]